# Baby names

## Assignment 1 for 23-03-2022

1. Dataset: https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv 
2. Questions: https://github.com/a-forty-two/COG_GN22CDBDS001_MARCH_22/blob/main/stats_US_Baby_names.ipynb 
3. Solutions: https://github.com/a-forty-two/COG_GN22CDBDS001_MARCH_22/blob/main/stats_US_Baby_names_solution.ipynb

# Step 1. Import the necessary libraryies

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from collections import Counter

# Step 2. Import the dataset from this address
# Step 3. Assign it to a variable called baby_names

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

# Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

# Step 5. Delete the column named 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop('Unnamed: 0', axis=1, inplace=True)
baby_names.drop('Id', axis=1, inplace=True)

# Step 6. Is there more male names or female names in the dataset

In [5]:
num_males = baby_names['Gender'].value_counts()['F']
num_females = baby_names['Gender'].value_counts()['M']
if (num_males > num_females):
    print("There are more males than females")
elif (num_females > num_males):
    print("There are more females than males")
else:
    print("There are equal number of males and females")

There are more males than females

# Step 7. Group the dataset by names and assign to names

In [6]:
baby_names.drop('Year', axis=1, inplace=True)
names = baby_names.groupby('Name').sum()
names

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6
...        ...
Zyra        42
Zyrah       11
Zyren        6
Zyria       59
Zyriah      58

[17632 rows x 1 columns]

# Step 8. How many different names exist in the dataset

In [7]:
len(names)

17632

# Step 9. What is the name with the most occurences?

In [8]:
names[names.Count == names.Count.max()]

        Count
Name
Jacob  242874

# Step 10. How many different names have the least occurences?

In [9]:
len(names[names.Count == names.Count.min()])

2578

# Step 11. What is the median name occurence?

In [10]:
names.Count.median()

49.0

# Step 12. What is the standard deviation of names?

In [11]:
names.Count.std()

11006.06946789057

# Step 13. Get a summary with the mean, min, max, std and quarties

In [12]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000